Revit 2024 API
FabricationPart.Vendor Property
 The vendor of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string Vendor { get; }
Visual Basic
Public ReadOnly Property Vendor As String
	Get
Visual C++
public:
property String^ Vendor {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace